wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/successful-transaction-authorize-message.json

{
  "type": "event",
  "id": "347901e1-8b53-42a4-951b-ec546a5078f1",
  "name": "transaction.authorized",
  "created_at": "2012-12-12T10:53:43+00:00",
  "merchant_account_id": "default",
  "gr4vy_id": "example",
  "environment": "sandbox",
  "target": {
    "type": "transaction",
    "id": "795c27e9d-6cc3-40f6-a359-1355c434c30d",
    "status": "authorization_succeeded",
    "payment_method": {
      "method": "card"
    },
    "external_identifier": "order-1234",
    "amount": 1299,
    "currency": "USD",
    "authorized_amount": 1299,
    "captured_amount": 0,
    "refunded_amount": 0,
    "payment_service_transaction_id": "8110000000002017185",
    "payment_link_id": null,
    "has_gift_card_redemptions": false,
    "pending_review": false,
    "error_code": null,
    "metadata": {
      "profile": "profile-1234"
    },
    "created_at": "2024-09-17T16:54:57.333316+00:00",
    "updated_at": "2024-09-17T16:55:06.560721+00:00"
  }
}