wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/successful-transaction-capture-message.json

{
  "type": "event",
  "id": "36d2c101-4db5-4afd-ba4b-8fd9b60764ab",
  "name": "transaction.captured",
  "created_at": "2024-07-22T19:56:22.973896+00:00",
  "merchant_account_id": "default",
  "gr4vy_id": "example",
  "environment": "sandbox",
  "target": {
    "type": "transaction",
    "id": "b332ca0a-1dce-4ae6-b27b-04f70db8fae7",
    "status": "capture_succeeded",
    "payment_method": {
      "method": "card"
    },
    "external_identifier": "12354846.6",
    "amount": 1299,
    "currency": "USD",
    "authorized_amount": 1299,
    "captured_amount": 0,
    "refunded_amount": 0,
    "payment_service_transaction_id": "8110000000002017185",
    "payment_link_id": null,
    "has_gift_card_redemptions": false,
    "pending_review": false,
    "error_code": null,
    "metadata": {
      "profile": "profile-1234"
    },
    "created_at": "2024-07-22T19:56:09.406614+00:00",
    "updated_at": "2024-09-17T16:55:06.560721+00:00"
  }
}